{"about-us.head_title":"About Us","about-us.header_1":"About Us","about-us.content_1":"Our role is to supplement, but not take the place of, the primary role of families in providing care for their children. By establishing and maintaining open and ongoing communication with families, we are able to strengthen the ties that connect the home with our center and enhance the individual development of the child(ren) in our care. When families entrust their children to us, we are challenged to have a significant and positive influence by providing a program of the highest quality designed to help give children the foundation they need to build self-esteem, develop school readiness, and reach their full potential in learning.","about-us.header_2":"Our Mission","about-us.content_2":"The mission of Galaxy Kids Academy is to be a leader in child education, inspiring lifelong learning by providing a quality program that benefits the child, the parent, the staff, and the community.","about-us.header_3":"Our Philosophy Galaxy","about-us.content_3":"Kids Academy strives to provide a quality Early Childhood Education Program filled with carefully chosen staff members, filled with love and compassion for children. We believe that children are our most important resource and that their early childhood experiences are crucial in the development of their future. Each staff member strives to offer an environment that is rich in quality and stimulates the child’s senses and where warmth and friendship are abundant, to meet the needs of the total development of your child. The program we pursue is geared toward helping your child develop habits of observation, questioning and listening while building a positive self-esteem. Our staff members are partners with our parents working together to meet both the needs of the children and their families.","about-us.header_4":"Our Goals","about-us.content_4":"Galaxy Kids Academy strives to provide an educational program to every child enrolled while offering a network of support to each family as a whole. Our teachers work in partnership with each family to identify individual goals and plans for the children. The curriculum we implement provides a comprehensive program for children and work toward development in the areas of communication, gross motor, fine motor, problem-solving, and personal-social.\r\n\r\nAs children 3, 4, and 5 years-old transition into our preschool program, their goals focus on developing approaches to learning, social and emotional development, physical development and health, language, literacy, and communication, mathematics, creative arts, science and technology, and social studies. Progress occurs when adults reinforce the child’s learning. Teachers support children at their current ability level, as well as provide opportunities for them to advance toward the next level of development. Program success requires a strong partnership with each family. Teachers, administrators, and parents work together to utilize a variety of resources within the program as well as the community, to ensure that all members of the family receive the support they need and\/or desire.","about-us.header_5":"Our Center","about-us.content_5":"Galaxy Kids Academy provides licensed child care and preschool for children 18 months to first grade. Programs are operated at 6543 Lankershim Blvd, North Hollywood, CA 91606.","about-us.header_6":"Our Staff","about-us.content_6":"The teaching team at Galaxy Kids Academy consists of educated and experienced early learning and care professionals. Administrators and instructors are experienced in the field. Each staff member strives to create a warm and loving environment filled with experiences that will foster intrinsic motivation for children to enjoy school and learn. We are dedicated to providing continued growth and educational opportunities for our team members. In addition to providing ongoing coaching for our teaching team, in-service training and professional development is continuously provided by Galaxy Kids Academy for all teaching staff in the areas of early childhood education, child development etc. All staff members maintain certification in first aid, along with infant\/child aid, adult CPR, and are trained in the areas of infant safe sleep, prevention of shaken baby syndrome, medication administration, child abuse and neglect mandated reporting, and blood borne pathogens and universal precautions is provided as well as continuous reviews of all of our health and safety policies.","admissions.head_title":"Admissions","admissions.header":"Admissions","admissions.sub_header_1":"Registration Procedure","admissions.sub_content_1":"A Galaxy Kids Academy contract form must be completed and returned to center management along with the registration fee (where applicable). Upon receipt of the contract and first month contract fee, your child will be registered based on availability. If current space is not available to meet your needs, your family’s name will be placed on a waiting list. We cannot guarantee that a space will be available for your child on the day you desire. Enrollment is based on availability and may be subject to priority enrollment rules of the center. Families may choose to be on the wait list at Galaxy Kids Academy with payment of a single registration fee, where permitted. When a space becomes available, the center will invite you to visit with your child to discuss the enrollment process. The visit will give your child an opportunity to spend time in his or her classroom and be introduced to the children and staff. During the visit, you will have an opportunity to observe your child in the classroom, meet with center management to schedule a start date, and review the enrollment procedure. Registration is required annually.","admissions.sub_header_2":"Enrollment Procedure","admissions.sub_content_2":"In order to secure appropriate staffing levels at all times of the day, we will ask you to provide the specific hours of care needed for your child, recognizing that you may need to change these periodically. Prior to your child’s start date, please feel free to schedule as many visits as necessary to help familiarize you and your child with the center. This is an excellent way to help your child feel comfortable in his or her classroom. During the enrollment process, you must complete forms regarding your child’s health and development. These forms include family information, a medical authorization and consent form, and a developmental history. An updated physical and immunization record is required for your child prior to enrollment. You are also expected to read and sign an enrollment contract that outlines the program’s policies. All forms in your child’s file must be updated annually. Please remember to provide the center with additional updates as needed (e.g., phone numbers, work information, change of emergency contact or medical information, including allergies).","admissions.sub_header_3":"Enrollment Contracts","admissions.sub_content_3":"Our contract year extends from September 1 through August 31 of each year. A contract may be arranged by the parent for any portion or for the full contract period. Contracts will be updated at the end of each year, August 31. In the event you find that you need to discontinue services prior to the end date of the contract, one month written notice must be provided. Your monthly fee will be adjusted from that start of the contract to the new ending date. Parents requesting to cancel contracts to modify days in attendance may do so once during the contract year by providing a one month written notice. Additional requests will be honored by the center after receiving payment of the $100 contract cancellation fee. Contracts must be signed by all parties responsible for payments. If parents elect to arrange payments from multiple responsible individuals, separate signed contracts will be required for all parties the agency is asked to bill for services.","contact-us.head_title":"Contact Us","contact-us.telephone":"CALL NOW: (818) 123-4567","contact-us.info.title":"Dream Land Child Care Center","contact-us.info.content":"6543 Lankershim BLVD\r\nNorth Hollywood, CA 91606\r\nGet Directions\r\nP: (818) 123-4567\r\ninfo@yahoo.com\r\nBusiness Hours\r\nMo, Tu, We, Th, Fr\r\n7:30am – 5:30pm","contact-us.form.title":"Start Here","contact-us.form.sub_title":"Do not fill this form out if you're a solicitor.","contact-us.form.First Name":"First Name","contact-us.form.Last Name":"Last Name","contact-us.form.Email":"Email","contact-us.form.Phone":"Phone","contact-us.form.Questions or Comments":"Questions or Comments","contact-us.form.SUBMIT":"SUBMIT","contact-us.explanation.title":"Contact Us","contact-us.explanation.content":"Our role is to supplement, but not take the place of, the primary role of families in providing care for their children. By establishing and maintaining open and ongoing communication with families, we are able to strengthen the ties that connect the home with our center and enhance the individual development of the children in our care. When families entrust their children to us, we are challenged to have a significant and positive influence by providing a program of the highest quality designed to help give children the foundation they need to build self-esteem, develop school readiness, and reach their full potential in learning. Contact us today to get started!","gallery.head_title":"Gallery","gallery.header":"Gallery","gallery.content":"Galaxy Kids Academy strives to provide an educational program to every child enrolled while offering a network of support to each family as a whole.\r\n\r\nOur teachers work in partnership with each family to identify individual goals and plans for the children. The curriculum we implement provides a comprehensive program for children and work toward development in the areas of communication, gross motor, fine motor, problem-solving, and personal-social.","home.head_title":"Home","home.header_section_text":"A Solid Foundation","home.header_section_sub_text":"For Your Children","home.header_section_button_text":"GET STARTED HERE","home.programs.header_1":"toddler programs","home.programs.content_1":"The toddler age group is where one and two-year-olds learn. We recognize and encourage these differences, and our toddler teaching staff is able to provide a variety of strategies that allow for each child to learn key skills while having fun. Our teachers provide individual attention and independent play that allows for early learning to prosper.","home.programs.header_2":"preschool programs","home.programs.content_2":"Preschool to the learning of two and exciting three and four-year-old child. Our days are filled with a variety of learning opportunities that incorporate individual learning styles and create a passion for academics. Our focus is on playful learning while also developing the social-emotional needs for each child.","home.programs.header_3":"pre-k programs","home.programs.content_3":"Our pre-k degree is designed to prepare children to enter kindergarten prepared for the following academic year. We provide a kindergarten curriculum important to school readiness and all other areas of development. The goal is for your child to enter kindergarten not only problem solving and social skills.","home.card.header_1":"Our Curriculum","home.card.content_1":"We use the Creative Curriculum for Infants, Toddlers, and Twos. The Creative Curriculum allows teachers to meet the individual learning needs of each child with developmentally appropriate activities.","home.card.header_2":"Admissions","home.card.content_2":"Please call for tuition rates and other enrollment information regarding our daycare facility. We accept DHR approved two-year-old certificates, Head Start, and Bright from the Start.","home.card.header_3":"Our Gallery","home.card.content_3":"Our school believes in offering a fun environment that allows all of our kids to develop, learn, and socialize in a safe and secure environment. See our gallery to learn more.","home.card.header_4":"Daily Schedules","home.card.content_4":"We offer a variety of daily schedules that allow for the children to develop on their own pace. Please contact us for more information.","home.education.title":"A Well Rounded Education","home.education.content":"Galaxy Kids Academy strives to provide a quality Early Childhood Education Program filled with carefully chosen staff members, filled with love and compassion for children. We believe that children are our most important resource and that their early childhood experiences are crucial in the development of their future.\r\n\r\nThe program we pursue is geared toward helping your child develop habits of observation, questioning and listening while building a positive self-esteem. Our staff members are partners with our parents working together to meet both the needs of the children and their families.","home.button.TUITION & FEES":"TUITION & FEES","home.button.ABOUT US":"ABOUT US","home.tour.title":"Take A Tour","home.tour.sub_title":"come see what we're about","home.tour.content":"Our role is to supplement, but not take the place of, the primary role of families in providing care for their children. By establishing and maintaining open and ongoing communication with families, we are able to strengthen the ties that connect the home with our center and enhance the individual development of the children in our care.","home.button.SCHEDULE TODAY":"SCHEDULE TODAY","our-programs.head_title":"Our Programs","our-programs.header":"Our Programs","our-programs.sub_big_header_1":"Our Programs Toddler Programs","our-programs.sub_header_1":"(18 months – 3years)","our-programs.sub_content_1":"The toddler age group is a diverse one, and each child is different. We recognize and encourage these differences, and our toddler teaching team’s practice a variety of strategies that allow for each child to begin defining his\/her own sense of independence while dependent on the adults caring for and teaching him\/her. Our toddler classrooms follow a daily routine that is consistent yet flexible. The children quickly learn to anticipate what will come next in their day and begin to demonstrate initiative. The teaching teams plan their lessons daily to ensure that they are supporting the children’s current interests and developmental progress. Observation and assessment provide key insight into the needs of the individual children and serve as a foundation for goal setting and lesson planning. Toilet training is also incorporated into the daily routine for the older toddlers who demonstrate interest and developmental readiness. Teachers and parents work in partnership to develop a toilet training plan for their child that is consistent between home and school. Our toddler program provides a solid stepping stone into our preschool. Toddlers typically begin their transition to preschool between 33 and 36 months old. At that time the child has many opportunities to visit his\/her new classroom for short periods of time to become acclimated with the larger class size and the preschool routine. Once the child is feeling comfortable in his\/her new setting, the teachers and parents agree upon a date for the child to move into the preschool program.","our-programs.sub_big_header_2":"Preschool Programs","our-programs.sub_header_2":"(3 years – 4 years)","our-programs.sub_content_2":"Preschool is the beginning of a very exciting time in the life of a young child. Our days are filled with a variety of learning opportunities that become the building blocks for each child’s preparation for kindergarten. We focus on developing social skills and developing a desire for learning in each child. While it feels like “we play all day”, we are very strategic in our planning to ensure that our expectations are appropriate for the current group of children we are working with. Through play the children learn problem solving skills, develop initiative, and practice math, science, reading, and writing throughout every part of the day. Our individualized assessment and planning strategies provide a comprehensive preschool program that blends into our pre- kindergarten program with a smooth transition.","our-programs.sub_big_header_3":"Pre-Kindergarten Programs","our-programs.sub_header_3":"(4 years to First Grade)","our-programs.sub_content_3":"Our pre-kindergarten program serves children who will be entering kindergarten the following fall and are 4 years of age. The pre-kindergarten curriculum we implement provides for individualized instruction and assessment and focuses not only on academics, but also problem solving and social skills. We enjoy special events, parties, and field trips throughout the school year and conclude with a graduation ceremony. Pre-kindergarten is a year of tremendous growth and development as the four-year olds turn five and become kindergarteners. The children transition from our program prepared for success in their school years to come.","bottom_buttons.contact_us":"CONTACT US","pagination.previous":"","pagination.next":"","Pagination Navigation":"","Showing":"","to":"","of":"","results":"","parents-corner.head_title":"Parents corner","parents-corner.header":"Parents Corner","parents-corner.sub_header_1":"Family involvement","parents-corner.sub_content_1":"Family involvement, family satisfaction, and shared decision making about your child’s experience are essential to the Galaxy Kids Academy program. We believe the center forms a caring and learning community in which families, staff, and children can interact and grow. We actively work to support family life and create ways to involve families in our program. Family involvement is an all-purpose term that encompasses family partnership groups and committees, volunteering, family education, and special events. We believe the key to family involvement is giving families a variety of ways to be involved, if they are able, in the life of the center.","parents-corner.sub_header_2":"Family-Teacher Partnerships","parents-corner.sub_content_2":"The family-teacher partnership at Galaxy Kids Academy helps children build a positive attitude toward themselves, toward language, literacy, and all other areas of the curriculum. Together, we can provide a stronger program for your child to foster a lifelong love of learning. The best teacher and family partnerships are based on frequent opportunities to share information. You can strengthen your family’s role as your child’s first and most important teacher and share in learning by participating in activities at home as well as at the center.","parents-corner.sub_header_3":"Family Communication","parents-corner.sub_content_3":"We are committed to creating a strong home and center connection by developing a process of open, honest communication with you regarding your child’s development and experience at the center. This includes a continual exchange of information between you and the center staff and management.","parents-corner.sub_header_4":"Electronic Communication","parents-corner.sub_content_4":"It is important that everyone who cares for your child has a sense of his or her daily experience, both at home and in the center. Staggered scheduling of staff makes the Electronic Communication System a critical communication link. The emails will give you a sense of your child’s day and keep you informed about his or her experiences and may also include a picture of your child in action. Parents may also send messages to your child’s teacher before arriving at the center to share information about your child’s morning to help with drop off time, making it easier for you to head off to work.","parents-corner.sub_header_5":"Postings","parents-corner.sub_content_5":"Bulletin boards are located throughout the center (in the foyer, hallways, and classroom entrances) to communicate news, daily events, staff notes, holiday closing dates, center visitors, etc.","parents-corner.sub_header_6":"Lockers","parents-corner.sub_content_6":"When center management or teachers have information to share with all families, this information could be left in your child’s locker for you, e-mailed to you via the center or classroom distribution list, or left on the check-in\/out station screen. Check with your center to find out where your mailbox is and please make sure to check it daily.","parents-corner.sub_header_7":"Partnership Groups","parents-corner.sub_content_7":"Family Partnership Groups provide an opportunity for you to be part of a forum in your center to discuss center-wide activities, family education, center updates, and much more. Ask center management for more information about the Family Partnership Group and other ways you can become involved.","bottom_buttons.our_programs":"OUR PROGRAMS","top_section.text":"Build A Solid Foundation","top_section.button_text":"GET STARTED HERE","privacy-policy.head_title":"Privacy Policy","privacy-policy.header":"Privacy Policy","privacy-policy.sub_header_1":"Drem Land Child Care Center Privacy Policy","privacy-policy.sub_content_1":"Last Updated on 11\/4\/19. This privacy policy is effective immediately.","privacy-policy.sub_header_2":"Introduction","privacy-policy.sub_content_2":"At Galaxy Kids Academy, we respect your privacy and are committed to protecting it through our compliance with this policy.\r\n\r\nThis policy describes the types of information we may collect from you or that you may provide when you visit this website (our “Website”) and our practices for collecting, using, maintaining, protecting and disclosing that information.\r\n\r\nThis policy applies to information we collect:\r\n\r\n⏵ On This Website.\r\n\r\n⏵ In e-mail, text and other electronic messages between you and this Website.\r\n\r\n⏵ Through mobile and desktop applications you download from this Website, which provide dedicated non-browser-based interaction between you and this Website.\r\n\r\n⏵ When you interact with our advertising and applications on third-party websites and services, if those applications or advertising include links to this policy.\r\n\r\nIt does not apply to information collected by:\r\n\r\n⏵ us offline or through any other means, including on any other website operated by Company or any third party (including our affiliates and subsidiaries); or\r\n\r\n⏵ any third party (including our affiliates and subsidiaries), including through any application or content (including advertising) that may link to or be accessible from or on the Website.\r\n\r\nPlease read this policy carefully to understand our policies and practices regarding your information and how we will treat it. If you do not agree with our policies and practices, your choice is not to use our Website. By accessing or using this Website, you agree to this privacy policy. This policy may change from time to time. Your continued use of this Website after we make changes is deemed to be acceptance of those changes, so please check the policy periodically for updates.","privacy-policy.sub_header_3":"Children Under the Age of 13","privacy-policy.sub_content_3":"Our Website is not intended for children under 13 years of age. No one under age 13 may provide any personal information to or on the Website. We do not knowingly collect personal information from children under 13. If you are under 13, do not use or provide any information on this Website or on or through any of its features\/register on the Website, make any purchases through the Website, use any of the interactive or public comment features of this Website or provide any information about yourself to us, including your name, address, telephone number, e-mail address or any screen name or user name you may use. If we learn we have collected or received personal information from a child under 13 without verification of parental consent, we will delete that information. If you believe we might have any information from or about a child under 13, please contact us via our contact us link.","privacy-policy.sub_header_4":"Information We Collect About You and How We Collect It","privacy-policy.sub_content_4":"We collect several types of information from and about users of our Website, including information:\r\n\r\n⏵ by which you may be personally identified, such as name, postal address, e-mail address, telephone number or ANY OTHER INFORMATION THE WEBSITE COLLECTS THAT IS DEFINED AS PERSONAL OR PERSONALLY IDENTIFIABLE INFORMATION UNDER AN APPLICABLE LAW (“personal information”);\r\n\r\n⏵ that is about you but individually does not identify you, and\/or\r\n\r\n⏵ about your internet connection, the equipment you use to access our Website and usage details.\r\n\r\nWe collect this information:\r\n\r\n⏵ Directly from you when you provide it to us.\r\n\r\n⏵ Automatically as you navigate through the site. Information collected automatically may include usage details, IP addresses and information collected through cookies, web beacons and other tracking technologies.\r\n\r\n⏵ From third parties, for example, our business partners.","privacy-policy.sub_header_5":"Information You Provide to Us.","privacy-policy.sub_content_5":"The information we collect on or through our Website may include:\r\n\r\n⏵ Information that you provide by filling in forms on our Website. This includes information provided at the time of registering to use our Website, subscribing to our service, posting material or requesting further services. We may also ask you for information when you report a problem with our Website.\r\n\r\n⏵ Records and copies of your correspondence (including e-mail addresses), if you contact us.\r\n\r\n⏵ Your responses to surveys that we might ask you to complete for research purposes.\r\n\r\n⏵ Details of transactions you carry out through our Website and of the fulfillment of your orders. You may be required to provide financial information before placing an order through our Website.\r\n\r\n⏵ Your search queries on the Website.\r\n\r\nYou also may provide information to be published or displayed (hereinafter, “posted”) on public areas of the Website, or transmitted to other users of the Website or third parties (collectively, “User Contributions”). Your User Contributions are posted on and transmitted to others at your own risk. Although we limit access to certain pages\/you may set certain privacy settings for such information by logging into your account profile, please be aware that no security measures are perfect or impenetrable. Additionally, we cannot control the actions of other users of the Website with whom you may choose to share your User Contributions. Therefore, we cannot and do not guarantee that your User Contributions will not be viewed by unauthorized persons.","privacy-policy.sub_header_6":"Information We Collect Through Automatic Data Collection Technologies.","privacy-policy.sub_content_6":"As you navigate through and interact with our Website, we may use automatic data collection technologies to collect certain information about your equipment, browsing actions and patterns, including:\r\n\r\n⏵ Details of your visits to our Website, including traffic data, location data, and other communication data and the resources that you access and use on the Website.\r\n\r\n⏵ Information about your computer and internet connection, including your IP address, operating system and browser type.\r\n\r\nWe also may use these technologies to collect information about your online activities over time and across third-party websites or other online services (behavioral tracking). The information we collect automatically is statistical data and does not include personal information, but we may maintain it or associate it with personal information we collect in other ways or receive from third parties. It helps us to improve our Website and to deliver a better and more personalized service, including by enabling us to:\r\n\r\n⏵ Estimate our audience size and usage patterns.\r\n\r\n⏵ Store information about your preferences, allowing us to customize our Website according to your individual interests.\r\n\r\n⏵ Speed up your searches.\r\n\r\n⏵ Recognize you when you return to our Website.\r\n\r\nThe technologies we use for this automatic data collection may include:\r\n\r\n⏵ Cookies (or browser cookies). A cookie is a small file placed on the hard drive of your computer. You may refuse to accept browser cookies by activating the appropriate setting on your browser. However, if you select this setting you may be unable to access certain parts of our Website. Unless you have adjusted your browser setting so that it will refuse cookies, our system will issue cookies when you direct your browser to our Website.\r\n\r\n⏵ Flash Cookies. Certain features of our Website may use local stored objects (or Flash cookies) to collect and store information about your preferences and navigation to, from and on our Website. Flash cookies are not managed by the same browser settings as are used for browser cookies.\r\n\r\n⏵ Web Beacons. Pages of our the Website may contain small electronic files known as web beacons (also referred to as clear gifs. pixel tags and single-pixel gifs) that permit the Company, for example, to count users who have visited those pages or opened an e-mail and for other related website statistics (for example, recording the popularity of certain website content and verifying system and server integrity).\r\n\r\nWe do not collect personal Information automatically, but we may tie this information to personal information about you that we collect from other sources or you provide to us.","privacy-policy.sub_header_7":"Third-party Use of Cookies and Other Tracking Technologies.","privacy-policy.sub_content_7":"Some content or applications, including advertisements, on the Website are served by third-parties, including advertisers, ad networks and servers, content providers and application providers. These third parties may use cookies alone or in conjunction with web beacons or other tracking technologies to collect information about you when you use our website. The information they collect may be associated with your personal information or they may collect information, including personal information, about your online activities over time and across different websites and other online services. They may use this information to provide you with interest-based (behavioral) advertising or other targeted content.\r\n\r\nWe do not control these third parties’ tracking technologies or how they may be used. If you have any questions about an advertisement or other targeted content, you should contact the responsible provider directly.","privacy-policy.sub_header_8":"How We Use Your Information","privacy-policy.sub_content_8":"We use information that we collect about you or that you provide to us, including any personal information:\r\n\r\n⏵ To present our Website and its contents to you.\r\n\r\n⏵ To provide you with information, products or services that you request from us.\r\n\r\n⏵ To provide you with information about our services\r\n\r\n⏵ To provide you with notices about your account\/subscription, including expiration and renewal notices.\r\n\r\n⏵ To carry out our obligations and enforce our rights arising from any contracts entered into between you and us, including for billing and collection.\r\n\r\n⏵ To notify you about changes to our Website or any products or services we offer or provide though it.\r\n\r\n⏵ To allow you to participate in interactive features on our Website.\r\n\r\n⏵ In any other way we may describe when you provide the information.\r\n\r\n⏵ To fulfill any purpose for which you provide it.\r\n\r\n⏵ For any other purpose with your consent.\r\n\r\nWe may use the information we have collected from you to enable us to display advertisements to our advertisers’ target audiences. Even though we do not disclose your personal information for these purposes without your consent, if you click on or otherwise interact with an advertisement, the advertiser may assume that you meet its target criteria.","privacy-policy.sub_header_9":"Disclosure of Your Information","privacy-policy.sub_content_9":"We may disclose aggregated information about our users, and information that does not identify any individual, without restriction.\r\n\r\nWe may disclose personal information that we collect or you provide as described in this privacy policy:\r\n\r\n⏵ To contractors, service providers and other third parties we use to support our business and who are bound by contractual obligations to keep personal information confidential and use it only for the purposes for which we disclose it to them.\r\n\r\n⏵ To a buyer or other successor in the event of a merger, divestiture, restructuring, reorganization, dissolution or other sale or transfer of some or all of the Company’s assets, whether as a going concern or as part of bankruptcy, liquidation or similar proceeding, in which personal information held by the Company about our Website users is among the assets transferred.\r\n\r\n⏵ To third parties to market their products or services to you if you have consented to these disclosures. We contractually require these third parties to keep personal information confidential and use it only for the purposes for which we disclose it to them.\r\n\r\n⏵ To fulfill the purpose for which you provide it. For example, if you give us an e-mail address to use the “e-mail a friend” feature of our Website, we will transmit the contents of that e-mail and your e-mail address to the recipients.\r\n\r\n⏵ For any other purpose disclosed by us when you provide the information.\r\n\r\nWe may also disclose your personal information:\r\n\r\n⏵ To comply with any court order, law or legal process, including to respond to any government or regulatory request.\r\n\r\n⏵ To enforce or apply our terms of use and other agreements, including for billing and collection purposes.\r\n\r\n⏵ If we believe disclosure is necessary or appropriate to protect the rights, property, or safety of the Company, our customers or others. This includes exchanging information with other companies and organizations for the purposes of fraud protection and credit risk reduction.","privacy-policy.sub_header_10":"Choices About How We Use and Disclose Your Information","privacy-policy.sub_content_10":"We strive to provide you with choices regarding the personal information you provide to us. We have created mechanisms to provide you with the following control over your information:\r\n\r\n⏵ Tracking Technologies and Advertising. You can set your browser to refuse all or some browser cookies, or to alert you when cookies are being sent. To learn how you can manage your Flash cookie settings, visit the Flash player settings page on Adobe’s website. If you disable or refuse cookies, please note that some parts of this site may then be inaccessible or not function properly.\r\n\r\n⏵ We do not control third parties’ collection or use of your information to serve interest-based advertising. However these third parties may provide you with ways to choose not to have your information collected or used in this way. You can opt out of receiving targeted ads from members of the Network Advertising Initiative (“NAI”) on the NAI’s website.","privacy-policy.sub_header_11":"Accessing and Correcting Your Information","privacy-policy.sub_content_11":"You may send us an e-mail via our contact link to request access to, correct or delete any personal information that you have provided to us. We cannot delete your personal information except by also deleting your user account. We may not accommodate a request to change information if we believe the change would violate any law or legal requirement or cause the information to be incorrect.\r\n\r\nIf you delete your User Contributions from the Website, copies of your User Contributions may remain viewable in cached and archived pages, or might have been copied or stored by other Website users. Proper access and use of information provided on the Website, including User Contributions, is governed by our terms of use.","privacy-policy.sub_header_12":"Your California Privacy Rights","privacy-policy.sub_content_12":"California Civil Code Section § 1798.83 permits users of our Website that are California residents to request certain information regarding our disclosure of personal information to third parties for their direct marketing purposes. To make such a request, please contact us via the Contact Us link.","privacy-policy.sub_header_13":"Data Security","privacy-policy.sub_content_13":"We have implemented measures designed to secure your personal information from accidental loss and from unauthorized access, use, alteration and disclosure\r\n\r\nThe safety and security of your information also depends on you. Where we have given you (or where you have chosen) a password for access to certain parts of our Website, you are responsible for keeping this password confidential. We ask you not to share your password with anyone.\r\n\r\nUnfortunately, the transmission of information via the internet is not completely secure. Although we do our best to protect your personal information, we cannot guarantee the security of your personal information transmitted to our Website. Any transmission of personal information is at your own risk. We are not responsible for circumvention of any privacy settings or security measures contained on the Website.","privacy-policy.sub_header_14":"Changes to Our Privacy Policy","privacy-policy.sub_content_14":"It is our policy to post any changes we make to our privacy policy on this page. If we make material changes to how we treat our users’ personal information, we will notify you by e-mail to the e-mail address specified in your account and\/or through a notice on the Website home page. The date the privacy policy was last revised is identified at the top of the page. You are responsible for ensuring we have an up-to-date active and deliverable e-mail address for you, and for periodically visiting our Website and this privacy policy to check for any changes.","privacy-policy.sub_header_15":"Contact Information","privacy-policy.sub_content_15":"To ask questions or comment about this privacy policy and our privacy practices, contact via our Contact Us link.\r\n\r\nThank You for Visiting the Website.","footer.column_1":"Site Map","footer.Home":"Home","footer.About Us":"About Us","footer.Gallery":"Gallery","footer.Contact Us":"Contact Us","footer.column_2":"Quick Links","footer.Admissions":"Admissions","footer.Tuition & Fees":"Tuition & Fees","footer.Our Programs":"Our Programs","footer.Parents Corner":"Parents Corner","footer.Privacy Policy":"Privacy Policy","footer.column_3":"Resources","footer.pdf_1":"Parent Handbook","footer.pdf_2":"Employee Handbook","footer.copyright":"© 2025 Dream Land Child Care Center","header.phone_text":"CALL US:","header.phone_number":"(123) 456-7890","tuitions-fees.head_title":"Tuition fees","tuitions-fees.header":"Tuition & Fees","tuitions-fees.sub_header_1":"Tuition Investment\/Fees","tuitions-fees.sub_content_1":"Tuition is due in advance with no deductions for any absences, holidays, illness, or closures due to inclement weather, power outages, or other situations beyond Galaxy Kids Academy’s control. If tuition is not paid on the day that it is due, a late fee will be added to the tuition for each day that it is late until it is paid in full. When a payment is delinquent for one week or more, care may be suspended until the balance is current and your child’s space will not be reserved.\n\nTuition is due regardless of a child’s absence from the program for any reason, and is required to hold a child’s space. A fee will be charged for a check returned for insufficient funds. If this occurs, Galaxy Kids Academy will have the option to refuse any future checks. There may be additional fees associated with special summer activities or field trips for the children. When you withdraw your child, you must give one month’s notice prior to withdrawal, in writing, to center management.","tuitions-fees.sub_header_2":"Payment Schedule","tuitions-fees.sub_content_2":"Payments are due, as per your contract, regardless of a child’s absence for any reason. These include a child’s illness, family illness, vacations, doctor appointments, parent’s days off work, etc.\n\nPlease check with the center for the present fee schedule. At the time of registration, parents of children who receive child care services may choose the following payment option:\n\nOPTION A: Payment is due in full on the first of each month, for the current month. After the 5th of each month, a $25.00 late fee will be added to the amount due for each child with an outstanding balance.\n\nPayment for additional services received outside of the contracted hours are due at the time services are provided.\n\nIf tuition is delinquent for a period of ten (10) days, the child will be suspended from the center. At that time, the parent must then make payment arrangements for the outstanding balance. Parents may re-instate their enrollment by making appropriate payment arrangements with the Center Director. Accounts left unpaid accumulate late fees and if necessary are sent to a collection agency.","tuitions-fees.sub_header_3":"Tuition Subsidies","tuitions-fees.sub_content_3":"Parents who receive assistance for child care, must have proof of current authorization, showing the amount to be received for assistance each week, prior to registration. If a child starts prior to authorization approval, or if there is a lapse time between approvals, the parent is responsible for 100% of the tuition\r\npayments until the center receives notice of authorization. The parent is liable for any of the tuition that is not covered by the payments received from the assistance program.\r\n\r\n*Note: Galaxy Kids Academy requires that parents sign in and out recording the times in the classroom in addition to clocking in and out at our security entrance computer. Parents must also note any absences on the classroom attendance sheet with the reason for the absence from our program. Parents who fail to log their hours or absence on the classroom attendance sheets will be responsible for the amount normally billed by the center.\r\n\r\nGalaxy Kids Academy participates in the Child Care Resource Center’s (CCRC) tuition subsidyprogram. For further detailed information, please visit the CCRC website:","tuitions-fees.sub_content_3_link":"https:\/\/www.ccrcca.org","tuitions-fees.sub_content_3_link_name":"www.ccrcca.org"}